/*
 * Copyright (c) 2022-2025, Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */

#ifndef HOST_REALM_RMI_H
#define HOST_REALM_RMI_H

#include <stdint.h>
#include <stdbool.h>

#include <realm_def.h>
#include <smccc.h>
#include <utils_def.h>

#define RMI_FNUM_MIN_VALUE	U(0x150)
#define RMI_FNUM_MAX_VALUE	U(0x18F)

/*
 * Defines member of structure and reserves space
 * for the next member with specified offset.
 */
#define SET_MEMBER_RMI	SET_MEMBER

/* Get RMI fastcall std FID from offset */
#define SMC64_RMI_FID(_offset)					\
	((SMC_TYPE_FAST << FUNCID_TYPE_SHIFT) |			\
	(SMC_64 << FUNCID_CC_SHIFT) |				\
	(OEN_STD_START << FUNCID_OEN_SHIFT) |			\
	(((RMI_FNUM_MIN_VALUE + (_offset)) & FUNCID_NUM_MASK)	\
	<< FUNCID_NUM_SHIFT))

#define RMI_ABI_VERSION_GET_MAJOR(_version)	(((_version) >> 16U) & 0x8FFF)
#define RMI_ABI_VERSION_GET_MINOR(_version)	((_version) & 0xFFFF)
#define RMI_ABI_VERSION_MAJOR			U(1)
#define RMI_ABI_VERSION_MINOR			U(0)
#define RMI_ABI_VERSION_VAL			((RMI_ABI_VERSION_MAJOR << 16U) | \
						 RMI_ABI_VERSION_MINOR)

#define __ALIGN_MASK(x, mask)		(((x) + (mask)) & ~(mask))
#define __ALIGN(x, a)			__ALIGN_MASK(x, (typeof(x))(a) - 1U)
#define ALIGN(x, a)			__ALIGN((x), (a))

/*
 * SMC_RMM_INIT_COMPLETE is the only function in the RMI that originates from
 * the Realm world and is handled by the RMMD. The remaining functions are
 * always invoked by the Normal world, forwarded by RMMD and handled by the
 * RMM
 */

#define RMI_PLANE_RTT_SINGLE				2UL

/* RmiStatusCode types */
/*
 * Status codes which can be returned from RMM commands.
 *
 * For each code, the meaning of return_code_t::index is stated.
 */
typedef enum {
	/*
	 * Command completed successfully.
	 *
	 * index is zero.
	 */
	RMI_SUCCESS = 0,
	/*
	 * The value of a command input value caused the command to fail.
	 *
	 * index is zero.
	 */
	RMI_ERROR_INPUT = 1,
	/*
	 * An attribute of a Realm does not match the expected value.
	 *
	 * index varies between usages.
	 */
	RMI_ERROR_REALM = 2,
	/*
	 * An attribute of a REC does not match the expected value.
	 *
	 * index is zero.
	 */
	RMI_ERROR_REC = 3,
	/*
	 * An RTT walk terminated before reaching the target RTT level,
	 * or reached an RTTE with an unexpected value.
	 *
	 * index: RTT level at which the walk terminated
	 */
	RMI_ERROR_RTT = 4,
	/*
	 * An attribute of a device does not match the expected value
	 */
	RMI_ERROR_DEVICE = 5,
	/*
	 * The command is not supported
	 */
	RMI_ERROR_NOT_SUPPORTED = 6,
	/*
	 * RTTE in an auxiliary RTT contained an unexpected value
	 */
	RMI_ERROR_RTT_AUX = 7,
	RMI_ERROR_COUNT
} status_t;

#define RMI_RETURN_STATUS(ret)		((ret) & 0xFF)
#define RMI_RETURN_INDEX(ret)		(((ret) >> 8U) & 0xFF)
#define RTT_MAX_LEVEL			(3L)
#define RTT_MIN_DEV_BLOCK_LEVEL		(2L)
#define RTT_MIN_LEVEL			(0L)
#define RTT_MIN_LEVEL_LPA2		(-1L)
#define ALIGN_DOWN(x, a)		((uint64_t)(x) & ~(((uint64_t)(a)) - 1ULL))
#define IS_ALIGNED(x, a)		(((x) & ((typeof(x))(a)-1U)) == 0U)
#define PAGE_SHIFT			FOUR_KB_SHIFT
#define RTT_LEVEL_SHIFT(l)		XLAT_ADDR_SHIFT(l)
#define RTT_L2_BLOCK_SIZE		(1UL << RTT_LEVEL_SHIFT(2U))
#define RTT_MAP_SIZE(level)		(1UL << RTT_LEVEL_SHIFT(level))
#define RTT_L1_BLOCK_SIZE		(1UL << RTT_LEVEL_SHIFT(1U))

#define REC_CREATE_NR_GPRS		8U
#define REC_HVC_NR_GPRS			7U
#define REC_GIC_NUM_LRS			16U

/*
 * When FEAT_LPA2 is enabled bits [51:50] of the OA are not
 * contiguous to the rest of the OA.
 */

#define TTE_OA_50_51_SHIFT		ULL(8)
#define TTE_OA_50_51_WIDTH		ULL(2)

/* Bitfields for the 2 MSBs on an OA */
#define OA_50_51_SHIFT			ULL(50)
#define OA_50_51_WIDTH			TTE_OA_50_51_WIDTH
#define OA_50_51_MASK			MASK(OA_50_51)

/*
 * When FEAT_S2PIE is enabled PIINDEX is saved at following index
 */
#define S2TTE_PI_INDEX_BIT0_SHIFT	6
#define S2TTE_PI_INDEX_BIT1_SHIFT	51
#define S2TTE_PI_INDEX_BIT2_SHIFT	53
#define S2TTE_PI_INDEX_BIT3_SHIFT	54
#define S2TTE_PI_INDEX_MASK		((1UL << S2TTE_PI_INDEX_BIT0_SHIFT) | \
					(1UL << S2TTE_PI_INDEX_BIT1_SHIFT) | \
					(1UL << S2TTE_PI_INDEX_BIT2_SHIFT) | \
					(1UL << S2TTE_PI_INDEX_BIT3_SHIFT))
/*
 * RmiUnprotectedS2AP type
 * Encoding for S2AP base index value for UNPROTECTED IPA
 */
#define RMI_PERM_S2AP_NO_ACCESS_IDX		U(0)
#define RMI_PERM_S2AP_RO_IDX			U(1)
#define RMI_PERM_S2AP_WO_IDX			U(2)
#define RMI_PERM_S2AP_RW_IDX			U(3)

/*
 * The Realm attribute parameters are shared by the Host via
 * RMI_REALM_CREATE::params_ptr. The values can be observed or modified
 * either by the Host or by the Realm.
 */
struct rmi_realm_params {
	/* Flags */
	SET_MEMBER(unsigned long flags0, 0, 0x8);			/* Offset 0 */
	/* Requested IPA width */
	SET_MEMBER(unsigned int s2sz, 0x8, 0x10);			/* 0x8 */
	/* Requested SVE vector length */
	SET_MEMBER(unsigned int sve_vl, 0x10, 0x18);			/* 0x10 */
	/* Requested number of breakpoints */
	SET_MEMBER(unsigned int num_bps, 0x18, 0x20);			/* 0x18 */
	/* Requested number of watchpoints */
	SET_MEMBER(unsigned int num_wps, 0x20, 0x28);			/* 0x20 */
	/* Requested number of PMU counters */
	SET_MEMBER(unsigned int pmu_num_ctrs, 0x28, 0x30);		/* 0x28 */
	/* Measurement algorithm */
	SET_MEMBER(unsigned char algorithm, 0x30, 0x38);		/* 0x30 */
	/* Number of auxiliary Planes */
	SET_MEMBER(unsigned int num_aux_planes, 0x38, 0x400);		/* 0x38 */
	/* Realm Personalization Value */
	SET_MEMBER(unsigned char rpv[RPV_SIZE], 0x400, 0x800);		/* 0x400 */
	SET_MEMBER(struct {
			/* Virtual Machine Identifier */
			unsigned short vmid;				/* 0x800 */
			/* Realm Translation Table base */
			unsigned long rtt_base;				/* 0x808 */
			/* RTT starting level */
			long rtt_level_start;				/* 0x810 */
			/* Number of starting level RTTs */
			unsigned int rtt_num_start;			/* 0x818 */
		   }, 0x800, 0x820);
	/* Flags */
	SET_MEMBER(unsigned long flags1, 0x820, 0x828);			/* 0x820 */
	/* MECID */
	SET_MEMBER(long mecid, 0x828, 0xF00);				/* 0x828 */
	/* Auxiliary Virtual Machine Identifiers */
	SET_MEMBER(unsigned short aux_vmid[3], 0xF00, 0xF80);		/* 0xF00 */
	/* Base address of auxiliary RTTs */
	SET_MEMBER(unsigned long aux_rtt_base[3], 0xF80, 0x1000);	/* 0xF80 */
};

/*
 * The REC attribute parameters are shared by the Host via
 * MI_REC_CREATE::params_ptr. The values can be observed or modified
 * either by the Host or by the Realm which owns the REC.
 */
struct rmi_rec_params {
	/* Flags */
	SET_MEMBER(u_register_t flags, 0, 0x100);		/* Offset 0 */
	/* MPIDR of the REC */
	SET_MEMBER(u_register_t mpidr, 0x100, 0x200);		/* 0x100 */
	/* Program counter */
	SET_MEMBER(u_register_t pc, 0x200, 0x300);		/* 0x200 */
	/* General-purpose registers */
	SET_MEMBER(u_register_t gprs[REC_CREATE_NR_GPRS], 0x300, 0x800); /* 0x300 */
	SET_MEMBER(struct {
		/* Number of auxiliary Granules */
		u_register_t num_aux;				/* 0x800 */
		/* Addresses of auxiliary Granules */
		u_register_t aux[MAX_REC_AUX_GRANULES];		/* 0x808 */
	}, 0x800, 0x1000);
};

/* Whether Host has completed emulation for an Emulatable Data Abort */
#define REC_ENTRY_FLAG_EMUL_MMIO	(UL(1) << 0)

/* Whether to inject a Synchronous External Abort into Realm */
#define REC_ENTRY_FLAG_INJECT_SEA	(UL(1) << 1)

/* Whether to trap WFI/WFE execution by Realm */
#define REC_ENTRY_FLAG_TRAP_WFI		(UL(1) << 2)
#define REC_ENTRY_FLAG_TRAP_WFE		(UL(1) << 3)

/* Host response to RIPAS change request */
#define REC_ENTRY_FLAG_RIPAS_RESPONSE_REJECT	(UL(1) << 4)

/*
 * Structure contains data passed from the Host to the RMM on REC entry
 */
struct rmi_rec_entry {
	/* Flags */
	SET_MEMBER(u_register_t flags, 0, 0x200);		/* Offset 0 */
	/* General-purpose registers */
	SET_MEMBER(u_register_t gprs[REC_EXIT_NR_GPRS], 0x200, 0x300); /* 0x200 */
	SET_MEMBER(struct {
		/* GICv3 Hypervisor Control Register */
		u_register_t gicv3_hcr;				/* 0x300 */
		/* GICv3 List Registers */
		u_register_t gicv3_lrs[REC_GIC_NUM_LRS];	/* 0x308 */
	}, 0x300, 0x800);
};

/*
 * RmiVdevAction
 * Represents realm action which triggered REC exit due to device communication.
 * Width: 8 bits
 */
#define RMI_VDEV_ACTION_GET_INTERFACE_REPORT	U(0)
#define RMI_VDEV_ACTION_GET_MEASUREMENTS	U(1)
#define RMI_VDEV_ACTION_LOCK			U(2)
#define RMI_VDEV_ACTION_START			U(3)
#define RMI_VDEV_ACTION_STOP			U(4)

/*
 * RmiRecExitFlags
 * Fieldset contains flags provided by the RMM during REC exit.
 * Width: 64 bits
 */
#define RMI_REC_EXIT_FLAGS_RIPAS_DEV_SHARED_SHIFT	U(0)
#define RMI_REC_EXIT_FLAGS_RIPAS_DEV_SHARED_WIDTH	U(1)

/*
 * Structure contains data passed from the RMM to the Host on REC exit
 */
struct rmi_rec_exit {
	/* Exit reason */
	SET_MEMBER_RMI(unsigned long exit_reason, 0, 0x8);/* Offset 0 */
	/* RmiRecExitFlags: Flags */
	SET_MEMBER_RMI(unsigned long flags, 0x8, 0x100);/* 0x8 */
	SET_MEMBER_RMI(struct {
			/* Exception Syndrome Register */
			unsigned long esr;		/* 0x100 */
			/* Fault Address Register */
			unsigned long far;		/* 0x108 */
			/* Hypervisor IPA Fault Address register */
			unsigned long hpfar;		/* 0x110 */
			/* Index of RTT tree active at time of the exit */
			unsigned long rtt_tree;		/* 0x118 */
			/* Level of requested RTT */
			unsigned long rtt_level;	/* 0x120 */
		   }, 0x100, 0x200);
	/* General-purpose registers */
	SET_MEMBER_RMI(unsigned long gprs[REC_EXIT_NR_GPRS], 0x200, 0x300); /* 0x200 */
	SET_MEMBER_RMI(struct {
			/* GICv3 Hypervisor Control Register */
			unsigned long gicv3_hcr;	/* 0x300 */
			/* GICv3 List Registers */
			unsigned long gicv3_lrs[REC_GIC_NUM_LRS]; /* 0x308 */
			/* GICv3 Maintenance Interrupt State Register */
			unsigned long gicv3_misr;	/* 0x388 */
			/* GICv3 Virtual Machine Control Register */
			unsigned long gicv3_vmcr;	/* 0x390 */
		   }, 0x300, 0x400);
	SET_MEMBER_RMI(struct {
			/* Counter-timer Physical Timer Control Register */
			unsigned long cntp_ctl;		/* 0x400 */
			/* Counter-timer Physical Timer CompareValue Register */
			unsigned long cntp_cval;	/* 0x408 */
			/* Counter-timer Virtual Timer Control Register */
			unsigned long cntv_ctl;		/* 0x410 */
			/* Counter-timer Virtual Timer CompareValue Register */
			unsigned long cntv_cval;	/* 0x418 */
		   }, 0x400, 0x500);
	SET_MEMBER_RMI(struct {
			/* Base address of pending RIPAS change */
			unsigned long ripas_base;	/* 0x500 */
			/* Size of pending RIPAS change */
			unsigned long ripas_top;	/* 0x508 */
			/* RIPAS value of pending RIPAS change */
			unsigned char ripas_value;	/* 0x510 */
			/*
			 * Base PA of device memory region, if RIPAS change is
			 * pending due to execution of
			 * RSI_RDEV_VALIDATE_MAPPING
			 */
			unsigned long ripas_dev_pa; /* 0x518 */
			/* Base addr of target region for pending S2AP change */
			unsigned long s2ap_base; /* 0x520 */
			/* Top addr of target region for pending S2AP change */
			unsigned long s2ap_top; /* 0x528 */
			/* Virtual device ID */
			unsigned long vdev_id; /* 0x530 */
		   }, 0x500, 0x600);

	/* Host call immediate value */
	SET_MEMBER_RMI(unsigned int imm, 0x600, 0x608);
	/* UInt64: Plane Index */
	SET_MEMBER_RMI(unsigned long plane, 0x608, 0x610);
	/* Address: VDEV which triggered REC exit due to device communication */
	SET_MEMBER_RMI(unsigned long vdev, 0x610, 0x618);
	/* RmiVdevAction: Action which triggered REC exit due to device comm */
	SET_MEMBER_RMI(unsigned char vdev_action, 0x618, 0x620);
	/* Bits64: Base IPA of target region for device mem mapping validation */
	SET_MEMBER_RMI(unsigned long dev_mem_base, 0x620, 0x628);
	/* Bits64: Top IPA of target region for device mem mapping validation */
	SET_MEMBER_RMI(unsigned long dev_mem_top, 0x628, 0x630);
	/* Addres: Base PA of device memory region */
	SET_MEMBER_RMI(unsigned long dev_mem_pa, 0x630, 0x700);

	/* PMU overflow status */
	SET_MEMBER_RMI(unsigned long pmu_ovf_status, 0x700, 0x800);
};

/*
